import React, { Component } from 'react'
import { Tab, Col, Container, Nav, Row  } from 'react-bootstrap'

import design from '../assets/design.png'
import team from '../assets/team.png'
import Programming from '../assets/programming.png'
import frameworks from '../assets/frameworks.webp'
import libraries from '../assets/Libraries.jpg'


export default class About extends Component {
  render() {
    return (
      <Container>
        <Tab.Container id="left-tabs-example" defaultActiveKey="first">
            <Row>
                <Col sm={3}>
 
                        <Nav variant="pills" className="Flex-column mt-5">
                            <Nav.Item>
                            <Nav.Link eventKey="first">
                                Design
                            </Nav.Link>
                            </Nav.Item>
                            <Nav.Item>
                            <Nav.Link eventKey="second">
                                Team
                            </Nav.Link>
                            </Nav.Item>
                            <Nav.Item>
                            <Nav.Link eventKey="third">
                                Programming
                            </Nav.Link>
                            </Nav.Item>
                            <Nav.Item>
                            <Nav.Link eventKey="forth">
                                Frameworks
                            </Nav.Link>
                            </Nav.Item>
                            <Nav.Item>
                            <Nav.Link eventKey="fifth">
                                Libraries
                            </Nav.Link>
                            </Nav.Item>
                        </Nav>

                </Col>
                <Col sm={9}>
                    <Tab.Content>
                        <Tab.Pane eventKey="first">
                            <img
                            src={design}
                            className="d-block w-100"
                            alt='pic'
                            />
                            <p>Наша команда дизайну - це група творчих майстрів, які володіють навичками та знаннями, необхідними для створення вражаючих веб-дизайнів. Ми беремо до уваги ваш бренд, цільову аудиторію та вимоги проекту, щоб створити дизайн, який відображає вашу унікальність та привабливість. Наші дизайнери працюють над кожним деталем, від композиції до колориту, з метою створення веб-дизайну, який залучає і залишає слід в пам'яті ваших користувачів.</p>
                        </Tab.Pane>

                        <Tab.Pane eventKey="second">
                            <img 
                            src={team}
                            className="d-block w-100"
                            alt='pic'
                            />
                            <p>Наша команда складається з висококваліфікованих професіоналів, які мають різноманітний досвід та експертизу у галузі веб-розробки та дизайну. Ми працюємо разом, об'єднуючи наші ідеї, творчий підхід та найновіші технології, щоб досягти найкращих результатів. Наша команда цінує співпрацю, відкритий обмін думками та постійне самовдосконалення, щоб забезпечити нашим клієнтам найкращі рішення.</p>
                        </Tab.Pane>

                        <Tab.Pane eventKey="third">
                            <img 
                            src={Programming}
                            className="d-block w-100"
                            alt='pic'
                            />
                            <h2>Наша команда програмістів</h2>
                            <p>Це група талановитих і досвідчених фахівців, пристрасних до програмування та розробки програмного забезпечення. Ми збираємо навколо себе найкращих фахівців, які володіють широким спектром навичок і знань у галузі веб-розробки, включаючи React, JavaScript, HTML, CSS та інші сучасні технології.</p>
                            <p>Наші програмісти мають глибоке розуміння концепцій програмування і вміють ефективно використовувати ці знання для створення високоякісного програмного забезпечення. Вони мають досвід розробки різноманітних веб-додатків, від простих сайтів до складних веб-платформ і мобільних додатків.</p>
                            <p>Наші програмісти завжди слідкують за новими технологічними тенденціями та оновленнями у світі розробки програмного забезпечення. Вони постійно покращують свої навички і розширюють свої знання, щоб бути в курсі останніх інновацій і забезпечувати найсучасніші рішення для наших клієнтів.</p>
                            <p>Наші програмісти не просто пишуть код. Вони володіють аналітичним мисленням і здатні розуміти потреби та вимоги наших клієнтів. Вони працюють у тісному співробітництві зі замовниками, щоб зрозуміти їхні бізнес-цілі та втілити їх у функціональне та ефективне програмне забезпечення.</p>
                            <p>Наші програмісти - це креативні проблемники, які завжди готові приймати виклики і знаходити інноваційні рішення. Вони працюють у команді, співпрацюючи з дизайнерами, інженерами та іншими спеціалістами, щоб створювати продукти, які перевершують очікування наших клієнтів.</p>
                        </Tab.Pane>

                        <Tab.Pane eventKey="forth">
                            <img 
                            src={frameworks}
                            className="d-block w-100"
                            alt='pic'
                            />
                            <h2>Використовуємо потужні фреймворки</h2>
                            <p>Ми використовуємо кілька потужних фреймворків для веб-розробки та розробки додатків, що дозволяють нам створювати високоякісні та масштабовані проекти. Ось декілька з них:</p>
                            <h3>React</h3>
                            <p>React - один з найпопулярніших та потужних фреймворків для розробки веб-додатків. Він забезпечує швидкий та ефективний рендеринг, дозволяє створювати компонентну структуру і забезпечує простоту управління станом додатка.</p>

                            <h3>Angular</h3>
                            <p>Angular - це фреймворк для розробки веб-додатків, розроблений компанією Google. Він пропонує повний набір інструментів для створення складних та масштабованих додатків, включаючи роутинг, обробку форм, управління станом та багато іншого.</p>

                            <h3>Vue.js</h3>
                            <p>Vue.js - це прогресивний фреймворк для розробки користувацького інтерфейсу. Він пропонує простоту використання та легкість навчання, що робить його чудовим вибором для початківців. Vue.js має гнучку архітектуру і прекрасно поєднується з іншими бібліотеками чи існуючими проектами.</p>

                            <h3>Flutter</h3>
                            <p>Flutter - це фреймворк для розробки перехресно-платформених мобільних додатків. За допомогою однієї кодової бази можна створювати додатки для iOS та Android. Flutter пропонує швидку розробку, гарний вигляд і високу продуктивність додатків. Він використовує мову програмування Dart та має вбудовану бібліотеку віджетів для створення користувацького інтерфейсу.</p>
                            <p>Ці фреймворки відомі своєю ефективністю, гнучкістю та великою спільнотою розробників. Ми вміло використовуємо їх, щоб створювати потужні та інноваційні веб-додатки та мобільні додатки для наших клієнтів.</p>
                        </Tab.Pane>

                        <Tab.Pane eventKey="fifth">
                            <img 
                            src={libraries}
                            className="d-block w-100"
                            alt='pic'
                            />
                              <h2>Бібліотеки для React:</h2>
                             <ul>
                                <li>React Router: для створення навігації та управління маршрутизацією в наших додатках.</li>
                                <li>Redux: для керування станом додатків та забезпечення одностороннього потоку даних.</li>
                                <li>Axios: для здійснення запитів на сервер та обміну даними з API.</li>
                                <li>Styled Components: для стилізації компонентів за допомогою CSS в JS підходу.</li>
                                <li>Jest та Enzyme: для тестування компонентів та забезпечення їхньої якості та надійності.</li>
                            </ul>

                            <p>Ці бібліотеки допомагають нам розширити можливості React та покращити ефективність нашого коду. Ми завжди слідкуємо за новими трендами та оновленнями у світі React, щоб забезпечити нашим клієнтам найсучасніші рішення.</p>

                            <p>Ми готові реалізувати ваші ідеї та втілити їх у веб-дизайні та програмному забезпеченні, використовуючи потужні фреймворки та бібліотеки. Звертайтесь до нас і дозвольте нам допомогти вам розвивати ваш бренд та досягати успіху в онлайн-світі.</p>

                        </Tab.Pane>
                    </Tab.Content>
                </Col>
            </Row>
        </Tab.Container>
      </Container>
    )
  }
}
